# Tier Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisDetailModel..::..Tier Property
EnergyAnalysisDetailModel Class See Also
---
Level of computation for energy analysis model.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public EnergyAnalysisDetailModelTier Tier { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Tier As EnergyAnalysisDetailModelTier
	Get
```

Visual C++
---
```text
public:
property EnergyAnalysisDetailModelTier Tier {
	EnergyAnalysisDetailModelTier get ();
}
```

# See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace